import java.io.PrintStream;
import java.util.Scanner;

public class Main {
    // Объявляем объект класса Scanner для ввода данных
    public static Scanner in = new Scanner(System.in);
    // Объявляем объект класса PrintStream для вывода данных
    public static PrintStream out = System.out;

    public static void main(String[] args) {
        // Считывание четырёх вещественных чисел x, a, b, c из консоли
        double x = in.nextDouble();
        double a = in.nextDouble();
        double b = in.nextDouble();
        double c = in.nextDouble();
        // Ввод переменной счётчика k
        int k = 0;

        // Определение поместиться ли мусор в контейнер
        if (x >= a) {
            // Если место в контейнере x больше или равно объему мусора a,
            // то вычитаем место, который занимает мусор a из контейнера x.
            // Иначе засчитываем, что мусор a нельзя поместить в контейнер x,
            // поэтому добавляем к счётчику k 1.
            x -= a;
        } else {
            k++;
        }
        if (x >= b) {
            // Если место в контейнере x больше или равно объему мусора b,
            // то вычитаем место, который занимает мусор b из контейнера x.
            // Иначе засчитываем, что мусор b нельзя поместить в контейнер x,
            // поэтому добавляем к счётчику k 1
            x -= b;
        } else {
            k++;
        }
        if (x >= c) {
            // Если место в контейнере x больше или равно объему мусора c,
            // то вычитаем место, который занимает мусор c из контейнера x.
            // Иначе засчитываем, что мусор c нельзя поместить в контейнер x,
            // поэтому добавляем к счётчику k 1
            x -= c;
        } else {
            k++;
        }
        // Выводим счётчик k
        out.println(k);
    }
}
